# RenumberIndexes Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleView..::..RenumberIndexes Method
PanelScheduleView Class See Also
---
Renumbers the Circuit Naming Index for the circuits in the panel.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public void RenumberIndexes()
```

Visual Basic
---
```text
Public Sub RenumberIndexes
```

Visual C++
---
```text
public:
void RenumberIndexes()
```

# See Also
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace